# -*- coding: utf-8 -*-
import os
from tamil import utf8 as tamilutf8
import yaml
from yaml import Loader, Dumper

CURRDIR = os.path.dirname(os.path.realpath(__file__))

def கடையெழுத்து(சொல்):
    return tamilutf8.get_letters(சொல்)[-1]

def முதலெழுத்து(சொல்):
    return tamilutf8.get_letters(சொல்)[0]

def உயிர்மெய்_ஆக்கு(எழுத்து1,எழுத்து2):
    return tamilutf8.joinMeiUyir(எழுத்து1,எழுத்து2)

def எழுத்தாக்கு(சொல்):
    return tamilutf8.get_letters(சொல்)

def சொல்லாக்கு(எழுத்துவரிசை):
    return tamilutf8.get_tamil_words(எழுத்துவரிசை)

# def உயிர்மெய்_பிரி(எழுத்து):
#     return tamilutf8.splitMeiUyir(எழுத்து)

def உயிர்மெய்விரி(பதம்):
    expandedlist = tamilutf8.get_letters_elementary(பதம்)
    return "".join(expandedlist)

def உயிர்மெய்தொகை(எழுத்துவரிசை):
    பதம்=""

    i=0
    while i < len(எழுத்துவரிசை)-1:
        if எழுத்துவரிசை[i] in _எழுத்துக்கள்['மெய்'] and \
             எழுத்துவரிசை[i+1] in _எழுத்துக்கள்['உயிர்']:
            பதம் = பதம் + tamilutf8.joinMeiUyir( எழுத்துவரிசை[i],  எழுத்துவரிசை[i+1])
            i=i+2
        else:
            பதம் = பதம் + எழுத்துவரிசை[i]
            i=i+1
    
    if i == len(எழுத்துவரிசை)-1:
        பதம் = பதம் + எழுத்துவரிசை[i]

    return பதம்


def load(filename):
    fo = open(filename, "r")
    entries = yaml.load(fo,Loader=Loader)
    return entries

_எழுத்துக்கள் = {}
_எழுத்துக்கள் = load(os.path.join(CURRDIR,"resources/எழுத்து.yaml"))


உயிர் = _எழுத்துக்கள்['உயிர்']
ஆய்தம்= _எழுத்துக்கள்['ஆய்தம்']
குறில்= _எழுத்துக்கள்['குறில்']
நெடில்= _எழுத்துக்கள்['நெடில்']
உயிர்க்குறில்= _எழுத்துக்கள்['உயிர்க்குறில்']
உயிர்நெடில்= _எழுத்துக்கள்['உயிர்நெடில்']

மெய்= _எழுத்துக்கள்['மெய்']
வல்லினம்  = _எழுத்துக்கள்['வல்லினம்']
மெல்லினம்= _எழுத்துக்கள்['மெல்லினம்']
இடையினம்= _எழுத்துக்கள்['இடையினம்']

உயிர்மெய் = _எழுத்துக்கள்['உயிர்மெய்']
உயிர்மெய்க்குறில்    = _எழுத்துக்கள்['உயிர்மெய்க்குறில்']
உயிர்மெய்நெடில்= _எழுத்துக்கள்['உயிர்மெய்நெடில்']

உடம்படுமெய்= _எழுத்துக்கள்['உடம்படுமெய்']
படர்க்கை_ஒருமை_இடப்பெயர்= _எழுத்துக்கள்['படர்க்கை_ஒருமை_இடப்பெயர்']
தன்மை_ஒருமை_இடப்பெயர்= _எழுத்துக்கள்['தன்மை_ஒருமை_இடப்பெயர்']
முன்னிலை_ஒருமை_இடப்பெயர்= _எழுத்துக்கள்['முன்னிலை_ஒருமை_இடப்பெயர்']
