import regex
from pytamil.தமிழ் import எழுத்து

def மாத்திரைவரிசை_கொடு(தொடர்):
    எழுத்துவரிசை =  எழுத்து.எழுத்தாக்கு(தொடர்)
    மாத்திரைவரிசை = []
    
    while True:
        _getnext_மாத்திரை(0,எழுத்துவரிசை) :


    return மாத்திரைவரிசை

def _getnext_மாத்திரை(index,எழுத்துவரிசை):

    inext = 0
    length =1

    for i in range(index,எழுத்துவரிசை):


    if எ in எழுத்து.உயிர்மெய்க்குறில்  or  எ in எழுத்து.உயிர்க்குறில் :
        மாத்திரைவரிசை.append(1)        
    elif எ in எழுத்து.உயிர்மெய்நெடில் or  எ in எழுத்து.உயிர்நெடில் :
        மாத்திரைவரிசை.append(2)
    elif எ in எழுத்து.மெய் or  எ in எழுத்து.ஆய்தம் :
        மாத்திரைவரிசை.append(1/2)

    return மாத்திரைவரிசை



def மொத்தமாத்திரை(தொடர்):
    மாத்திரைவரிசை = மாத்திரை_கொடு(தொடர்)
    மாத்திரை=0
    for மா in மாத்திரைவரிசை:
        மாத்திரை = மாத்திரை + மா
    
    return மாத்திரை



# உயிரளபெடை 3
# உயிர்மெய் நெடில்	2
# உயிர்மெய்க் குறில் 1
# ஒற்றளபெடை 1
# ஐகாரக்குறுக்கம் 1
# ஒளகாரக்குறுக்கம்	1
# குற்றியலுகரம் 1/2 
# குற்றியலிகரம்	1/2
# ஆய்தம் 1/2
# மகரக்குறுக்கம் 1/4
# ஆய்தக்குறுக்கம் 1/4    