grammar  சொல்;

சொல் : ஒர்_எழுத்து_ஒரு_மொழி
            | பொதுமொழி;
பொதுமொழி : மொழிமுதல் மொழியிடை*? மொழியிறுதி;

ஒர்_எழுத்து_ஒரு_மொழி : ஒரெழுத்து;

// மொழி முதல் எழுத்துகள்
// ---------------------------------

// உயிர் எழுத்துகள் பன்னிரண்டும் சொல்லின் முதலில் வரும். 
// மெய் எழுத்துகள் உயிர் எழுத்துகளுடன் சேர்ந்தே சொல்லின் முதலில் வரும்
// ககர வருக்கம் -  க, கா, கி, கீ, கு, கூ, கெ, கே, கை, கொ, கோ, கௌ  ்
// நெடில் எழுத்துகள் மட்டுமே தனித்து ஒரு சொல்லாக வரும். தனி உயிர் நெடில் எழுத்துகள் சொற்களாக அமைவதும் உண்டு 

// க், த், ந் , ப், ம், - பன்னிரண்டு உயிர் எழுத்துகளோடும் சேர்ந்து சொல்லுக்கு முதலில் வரும்

// ஙகரம். அ, இ ஆகிய சுட்டு எழுத்துகளுக்குப் பின்னும், யா, எ, ஆகிய வினா எழுத்துகளுக்குப் பின்னும் சொல்லுக்கு முதலில் வரும். 
// சகரம் பன்னிரண்டு உயிர் எழுத்துகளோடும் சேர்ந்து மொழிக்கு முதலில் வரும். ஆனால் பழங்காலத்தில் அ, ஐ, ஒள என்னும் ழூன்று உயிர் எழுத்துகளுடனும் மொழிக்கு முதலில் வருவதில்லை.
// ஞகரம் அ, ஆ, எ, ஒ ஆகிய நான்கு உயிர் எழுத்துகளுடன் சேர்ந்து சொல்லுக்கு முதலில் வரும். 
// யகர மெய் எழுத்து அ, ஆ, உ, ஊ, ஓ, ஓள ஆகிய ஆறு உயிர் எழுத்துகளோடும் சேர்ந்து சொல்லுக்கு முதலில் வரும். யகர மெய் எழுத்து, பழங்காலத்தில் ஆ (ய்+ஆ=யா) என்னும் எழுத்துடன் மட்டுமே பயன்படுத்தப்பட்டது. 
// வகர மெய் எழுத்து அ, ஆ, இ, ஈ, எ, ஏ, ஐ, ஒள ஆகிய எட்டு உயிர் எழுத்துகளோடும் சேர்ந்து சொல்லுக்கு முதலில் வரும்.

// ட, ண, ர, ல, ழ, ள, ற, ன என்னும் எட்டு மெய் எழுத்துகளும் மொழிக்கு முதலில் வருவதில்லை. 

ஒரெழுத்து :  உயிர்மெய்நெடில் | உயிர்நெடில்;

மொழிமுதல் :  உயிர்க்குறில் | உயிர்நெடில் 
                | ('க்' | 'ங்' | 'ச்' | 'த்' | 'ந்' | 'ப்' | 'ம்') (உயிர்க்குறில் | உயிர்நெடில்)
                | ஞகர_முதல் | யகர_முதல் | வகர_முதல்;




// மொழி இறுதி எழுத்துகள்
// ---------------------------------

// உயிர் எழுத்துகள் பன்னிரண்டும் சொல்லுக்கு இறுதியில் வரும். அவற்றில் எகரக் குறில் அளபெடையாக மட்டுமே சொல்லுக்கு
// இவற்றில் வல்லின மெய் எழுத்துகள் சொல்லுக்கு இறுதியில் வருவது இல்லை
// மெல்லின மெய் எழுத்துகளில் ஞ், ண், ந், ம், ன் ஆகிய ஐந்தும் சொல்லுக்கு இறுதியில் வரும்.
// இடையின மெய் எழுத்துகள் ஆறும் (ய், ர், ல், வ், ழ், ள்) சொல்லுக்கு இறுதியில் வரும். 
// உயிர் எழுத்துகள் பன்னிரண்டும், ஞ, ண, ந, ம, ன,ய, ர, ல,வ, ழ, ள ஆகிய பதினொரு மெய் எழுத்துகளும் குற்றியலுகரமும் ஆக இருபத்து நான்கும் சொல்லுக்கு இறுதியில் வரும்.


மொழியிறுதி : உயிர்க்குறில் | உயிர்நெடில் 
                | 'ஞ்' | 'ண்' | 'ந்' | 'ம்' | 'ன்' // 5 மெல்லினம்
                | இடையினம்;




// இடைநிலை
// ---------------------------------

// வேற்றுநிலை மெய்ம்மயக்கம்

// மெய்எழுத்துகள் பதினெட்டில் க, ச, த, ப என்னும் நான்கு மெய் எழுத்துகள் தவிர்த்து, ஏனைய பதினான்கு மெய்எழுத்துகளும் வேற்றுநிலை மெய்ம்மயக்கத்தில் வரும்.

// ‘ங்’ என்னும் மெய்எழுத்துக்குப் பின், ‘க்’ என்னும் மெய்எழுத்து மட்டுமே வரும் பிற மெய் எழுத்துகள் வருவது இல்லை. 
// ‘ஞ்’ என்னும் மெய் எழுத்துக்குப் பின் ச், ய் ஆகிய மெய் எழுத்துகள் வரும். 
// ‘ட்’ என்னும் மெய் எழுத்துக்குப் பின் க், ச், ப் ஆகிய மெய் எழுத்துகள் வரும் 
// ‘ண்’ என்னும் மெய்எழுத்துக்குப் பின் க், ச், ஞ், ட், ப், ம், ய், வ் ஆகிய எட்டு மெய் எழுத்துகளும் வரும். 
// ‘ந்’ என்னும் மெய் எழுத்துக்குப் பின் த், ய் என்னும் மெய்எழுத்துகள் வரும். 
// ‘ய்’ என்னும் மெய் எழுத்துக்குப் பின் க், ச், ஞ், த், ந், ப்,ம், வ் ஆகிய மெய் எழுத்துகள் வரும். 
// ‘ர்’ என்னும் மெய் எழுத்துக்குப் பின் க், ச், ஞ், த், ந், ப், ம், வ் ஆகிய மெய் எழுத்துகள் வரும்.
// ‘ல்’ என்னும் மெய் எழுத்துக்குப் பின் க், ச், ப், ய், வ் என்னும் மெய் எழுத்துகள் வரும்.
// ‘ழ்’ என்னும் மெய் எழுத்துக்குப் பின் க், ச், ஞ், த், ந், ப், ம், வ் ஆகிய மெய் எழுத்துகள் வரும். 
// ‘ள்’ என்னும் மெய் எழுத்துக்குப் பின் க், ச், ப், ய், வ் ஆகிய மெய் எழுத்துகள் வரும்.
// ‘ற்’ என்னும் மெய் எழுத்துக்குப் பின் க், ச், ப் ஆகிய மெய் எழுத்துகள் வரும்.
// ‘ன்’ என்னும் மெய் எழுத்துக்குப் பின் க், ச், ஞ், ப், ம், ய், வ், ற் என்னும் மெய் எழுத்துகள் வரும்.

// உடன்நிலை மெய்ம்மயக்கம்
// மெய் எழுத்துகள் பதினெட்டில் ர், ழ் என்னும் மெய் எழுத்துகளைத் தவிர ஏனைய பதினாறு மெய் எழுத்துகளும் உடன்நிலை மெய்ம்மயக்கத்தில் வரும்

// ஈர்ஒற்று மயக்கம் 
// ய், ர், ழ் என்னும் மூன்று மெய் எழுத்துகளை அடுத்து, க், ங், ச், ஞ், த்,ந், ப், ம் ஆகிய மெய் எழுத்துகள் ஈர்ஒற்றுகளாகச் சேர்ந்து வரும். 

// செய்யுளில் ஈர்ஒற்று மயக்கம்
// போன்ம் , மருண்ம் - இந்த மகரக் குறுக்கங்களும் ஈர் ஒற்று மயக்கம் ஆகும். இது செய்யுளில் மட்டுமே இடம்பெறும் என்பது குறிப்பிடத்தக்கது. 

மொழியிடை : வேற்றுநிலை_மெய்ம்மயக்கம்
                | உடன்நிலை_மெய்ம்மயக்கம்
                | ஈர்ஒற்று_மயக்கம்;
                


// ----
உயிர்மெய்க்குறில் : மெய் உயிர்க்குறில் ;
உயிர்மெய்நெடில் : மெய் உயிர்நெடில்;

சுட்டெழுத்து : 'அ'|'இ'; // சுட்டு எழுத்து
வினாயெழுத்து : 'யா'| 'எ';  //வினா எழுத்து

ஞகர_முதல் : 'ஞ்' ('அ' | 'ஆ' | 'எ' | 'ஒ');
யகர_முதல் : 'ய்' ('அ' | 'ஆ' | 'உ' | 'ஊ' | 'ஓ' | 'ஓள');
வகர_முதல் : 'வ்' ('அ' | 'ஆ' | 'இ' | 'ஈ' | 'எ' | 'ஏ' | 'ஐ' | 'ஒள');

வேற்றுநிலை_மெய்ம்மயக்கம் : ஙகர_வேற்றுநிலை | ஞகர_வேற்றுநிலை | டகர_வேற்றுநிலை | ணகர_வேற்றுநிலை 
                            | நகர_வேற்றுநிலை | மகர_வேற்றுநிலை | யகர_வேற்றுநிலை | ரகர_வேற்றுநிலை 
                            | லகர_வேற்றுநிலை | வகர_வேற்றுநிலை | ழகர_வேற்றுநிலை | ளகர_வேற்றுநிலை 
                            | றகர_வேற்றுநிலை | னகர_வேற்றுநிலை ;

ஙகர_வேற்றுநிலை  : 'ங்'  ('க்'); 
ஞகர_வேற்றுநிலை  : 'ஞ்' ('ச்' | 'ய்'); 
டகர_வேற்றுநிலை   : 'ட்'  ('க்' | 'ச்' | 'ப்'); 
ணகர_வேற்றுநிலை : 'ண்' ('க்' | 'ச்' | 'ஞ்' | 'ட்' | 'ப்' | 'ம்' | 'ய்' | 'வ்'); 
நகர_வேற்றுநிலை   : 'ந்'  ('த்' | 'ய்'); 
மகர_வேற்றுநிலை   : 'ம்' மெய் ;
யகர_வேற்றுநிலை  : 'ய்'  ('க்' | 'ச்' | 'ஞ்' | 'த்' | 'ந்' | 'ப்' | 'ம்' | 'வ்'); 
ரகர_வேற்றுநிலை   : 'ர்'  ('க்' | 'ச்' | 'ஞ்' | 'த்' | 'ந்' | 'ப்' | 'ம்' | 'வ்'); 
லகர_வேற்றுநிலை  : 'ல்'  ('க்' | 'ச்' | 'ப்' | 'ய்' | 'வ்'); 
வகர_வேற்றுநிலை  : 'வ்' மெய் ;
ழகர_வேற்றுநிலை  : 'ழ்'  ('க்' | 'ச்' | 'ஞ்' | 'த்' | 'ந்' | 'ப்' | 'ம்' | 'வ்'); 
ளகர_வேற்றுநிலை  : 'ள்' ('க்' | 'ச்' | 'ப்' | 'ய்' | 'வ்'); 
றகர_வேற்றுநிலை  : 'ற்'  ('க்' | 'ச்' | 'ப்'); 
னகர_வேற்றுநிலை : 'ன்'  ('க்' | 'ச்' | 'ஞ்' | 'ப்' | 'ம்' | 'ய்' | 'வ்' | 'ற்'); 


// உடன்நிலை_மெய்ம்மயக்கம் : (வல்லினம் | மெல்லினம் | 'ய்' | 'ல்'| 'வ்'| 'ள்') ; // ர், ழ்  தவிர மற்ற இடையினம்
உடன்நிலை_மெய்ம்மயக்கம் : 'க்க்' | 'ங்ங்' | 'ச்ச்' | 'ஞ்ஞ்'
                           | 'ட்ட்' | 'ண்ண்' | 'த்த்' | 'ந்ந்'
                           | 'ப்ப்' | 'ம்ம்' | 'ய்ய்' | 'ல்ல்'
                           | 'வ்வ்' | 'ழ்ழ்' | 'ள்ள்' | 'ற்ற்' | 'ன்ன்' ; // ர், ழ்  தவிர மற்ற மெய் எழுத்துகள்

ஈர்ஒற்று_மயக்கம் : ('ய்' | 'ர்' | 'ழ்' )  ( 'க்க்' | 'ங்ங்' | 'ச்ச்' | 'ஞ்ஞ்' | 'த்த்' | 'ந்ந்' | 'ப்ப்' | 'ம்ம்' ) ;

உயிர்க்குறில் :'அ'|'இ'|'உ'|'எ'|'ஒ' ;
உயிர்நெடில் :  'ஆ'|'ஈ'|'ஊ'|'ஏ'|'ஐ'|'ஓ'|'ஔ';
ஆய்தம் : 'ஃ'; 
மெய் : 'க்'|'ச்'|'ட்'|'த்'|'ப்'|'ற்'|'ஞ்'|'ங்'|'ண்'
        |'ந்'|'ம்'|'ன்'|'ய்'|'ர்'|'ல்'|'வ்'|'ழ்'|'ள்' ;

வல்லினம்:  'க்'|'ச்'|'ட்'|'த்'|'ப்'|'ற்';
மெல்லினம்: 'ங்'| 'ஞ்' | 'ண்'| 'ந்'|'ம்' | 'ன்' ;
இடையினம்: 'ய்' | 'ர்'| 'ல்'| 'வ்'| 'ழ்'| 'ள்' ;
        
உயிரளபெடை_எழுத்து : 'ஆஅ'| 'ஈஇ'|'ஊஉ'| 'ஏஎ'| 'ஐஇ'| 'ஓஒ'| 'ஔஉ' ;
 
ஒற்றளபெடை_எழுத்து : 'ங்' | 'ஞ்' | 'ண்' | 'ந்' | 'ம்' | 'ய்'
                        | 'ல்' | 'வ்' | 'ள்' | 'ன்' | 'ஃ' ;