grammar வெண்பா;
import சீர்;

// start: வெண்பா ;

வெண்பா : (குறள்_வெண்பா | நேரிசை_வெண்பா | பஃறொடை_வெண்பா | கலி_வெண்பா) EOF ;

குறள்_வெண்பா : அடி ஈற்றடி ;
சிந்தியல்_வெண்பா : அடி அடி ஈற்றடி ;
நேரிசை_வெண்பா : அடி அடி அடி ஈற்றடி ;
பஃறொடை_வெண்பா :   அடி அடி அடி அடி ஈற்றடி 
                    | அடி அடி அடி அடி அடி ஈற்றடி
                    | அடி அடி அடி அடி அடி அடி ஈற்றடி
                    | அடி அடி அடி அடி அடி அடி அடி ஈற்றடி
                    | அடி அடி அடி அடி அடி அடி அடி அடி ஈற்றடி                   
                    | அடி அடி அடி அடி அடி அடி அடி அடி அடி ஈற்றடி
                    | அடி அடி அடி அடி அடி அடி அடி அடி அடி அடி ஈற்றடி
                    | அடி அடி அடி அடி அடி அடி அடி அடி அடி அடி அடி ஈற்றடி
                    ;
கலி_வெண்பா : அடி அடி அடி அடி அடி அடி அடி அடி அடி அடி அடி அடி+ ஈற்றடி ;


அடி: சீர் I சீர் I சீர் I சீர் NL ;
ஈற்றடி: சீர் I சீர் I ஈற்றுச்சீர் ;

// சீர்:  ஈரசை | மூவசை   ;
சீர்: தேமா | புளிமா | கருவிளம் | கூவிளம் |
    தேமாங்காய் | புளிமாங்காய்| கருவிளங்காய் | கூவிளங்காய் ;


ஈற்றுச்சீர்: நாள் | மலர் |  காசு | பிறப்பு  ;

// ஈரசை: தேமா | புளிமா | கருவிளம் | கூவிளம்     ;

// மூவசை: தேமாங்காய் | புளிமாங்காய்| கருவிளங்காய் | கூவிளங்காய்   ;

// தேமா ... கூவிளங்காய் come from the imported சீர் grammar.

// அசை: நிரை |நேர்  ;

நாள்: நேர் ;
மலர்: முதல்நிரை ;
காசு: நேர் நேர் ;
பிறப்பு: முதல்நிரை நேர் ;

