# -*- coding: utf-8 -*-

import pytest
from pytamil.தமிழ் import புணர்ச்சி

entries = புணர்ச்சி.load( "pytamil/தமிழ்/resources/புணர்ச்சிவிதிகள்.yaml" )
சான்றுகள் = []
சான்றுகள் = புணர்ச்சி.getசான்றுகள்(entries,சான்றுகள் )

params = []
for சான்று in சான்றுகள்:
	params.append( (சான்று.நிலைமொழி, சான்று.வருமொழி, சான்று.தொடர்மொழி))


@pytest.mark.parametrize("நிலைமொழி,வருமொழி,தொடர்மொழி", params)
def test_தொடர்மொழி_ஆக்கு(நிலைமொழி, வருமொழி , தொடர்மொழி):
	தொடர்மொழி_பதங்கள் = புணர்ச்சி.தொடர்மொழி_ஆக்கு(நிலைமொழி, வருமொழி )

	assert len(தொடர்மொழி_பதங்கள்) == len(தொடர்மொழி)

	for பதம் in தொடர்மொழி_பதங்கள்:
		assert பதம் in தொடர்மொழி
