import pytest
from pytamil.தமிழ் import எழுத்து
from pytamil.தமிழ் import சீர்



@pytest.mark.parametrize("பதம்", \
    [ 
        ("வானினும்"),
        ("நீரினும்"),
        ("தண்மையும்"),
    ])
def test_கூவிளம்(பதம்):   
    புது_சீர்_வாய்பாடு = சீர்.சீர்_வாய்பாடு_கொடு(பதம்)

    assert "கூவிளம்" == புது_சீர்_வாய்பாடு
    
    
	
@pytest.mark.parametrize(" பதம்", \
    [ 
        ("உயர்ந்தன்று"),
    ])
def test_புளிமாங்காய்(பதம்):   
    புது_சீர்_வாய்பாடு = சீர்.சீர்_வாய்பாடு_கொடு(பதம்)

    assert "புளிமாங்காய்" == புது_சீர்_வாய்பாடு
