# -*- coding: utf-8 -*-

import sys
import pytamil
from pytamil import தமிழ்
from pytamil.தமிழ்  import மாத்திரை
import csv
import os


குறள் = ['''அகர முதல எழுத்தெல்லாம் ஆதி
           பகவன் முதற்றே உலகு.''',
        '''கற்றதனால் ஆய பயனென்கொல் வாலறிவன்
           நற்றாள் தொழாஅர் எனின்.''',
        '''துப்பார்க்குத் துப்பாய துப்பாக்கித் துப்பார்க்குத்
           துப்பாய தூஉம் மழை.''',
        '''அறத்தாற்றின் இல்வாழ்க்கை ஆற்றின் புறத்தாற்றில்
           போஒய்ப் பெறுவ தெவன்''',
        '''அந்தணர் என்போர் அறவோர்மற் றெவ்வுயிர் க்கும்
           செந்தண்மை பூண்டொழுக லான்'''
        ]

def குறள்_மாத்திரைவரிசைகள்_கொடு(குறள்_அடி):
    அடிகள் = குறள்_அடி.splitlines()
    
    பதங்கள் =[]
    மாத்திரைவரிசைகள் =[]
    for அடி in  அடிகள்:
        அ = அடி.strip()
        அ = அ.replace('.','')
        அ = அ.replace('?','')

        பதங்கள்.extend(அ.split())

    for பதம் in  பதங்கள்:

        மாத்திரைவரிசை = மாத்திரை.மாத்திரைவரிசை_கொடு(பதம்)
        # print(மாத்திரை.format(மாத்திரைவரிசை))
        மாத்திரைவரிசைகள்.append(மாத்திரைவரிசை)
    
    return மாத்திரைவரிசைகள்


def குறள்_மாத்திரைஎண்கள்_கொடு(மாத்திரைவரிசைகள்):
    மாத்திரைஎண்கள்=''
    for மாத்திரைவரிசை in மாத்திரைவரிசைகள்:
        for எ in மாத்திரைவரிசை:
            மாத்திரைஎண்கள் = மாத்திரைஎண்கள் +str(எ[2]) + ' '
        மாத்திரைஎண்கள் = மாத்திரைஎண்கள்.rstrip() + "    "

    return மாத்திரைஎண்கள்

# def print_மாத்திரைவரிசைகள்(மாத்திரைவரிசைகள்):

def convert_திருக்குறள்(filepath):
    inpath = filepath
    outpath = os.path.join(os.path.dirname(filepath),"திருக்குறள்-output")
    with open(inpath, "r") as infile, open(outpath, "w") as outfile:
        reader = csv.reader(infile, delimiter=',')
        next(reader, None)  # skip the headers

        writer = csv.writer(outfile)
        writer.writerow(["குறள்", "எண்", "மாத்திரை" ])
        # writer.writerow(row)

        for row in reader:
            குறள்_அடி = row[3]
            குறள்_எண் = row[4]
            மாத்திரைவரிசைகள் = குறள்_மாத்திரைவரிசைகள்_கொடு(குறள்_அடி)
            மாத்திரைஎண்கள் = குறள்_மாத்திரைஎண்கள்_கொடு(மாத்திரைவரிசைகள்)
            writer.writerow([குறள்_அடி, குறள்_எண், மாத்திரைஎண்கள்])
            # print (குறள்_எண், மாத்திரைஎண்கள்)
            # print()



# மாத்திரைவரிசைகள் = குறள்_மாத்திரைவரிசைகள்_கொடு(குறள்[3])
# print(குறள்_மாத்திரைஎண்கள்_கொடு(மாத்திரைவரிசைகள்))
# for மாத்திரைவரிசை in மாத்திரைவரிசைகள்:
#     print(மாத்திரை.format(மாத்திரைவரிசை))


convert_திருக்குறள்("pytamil/தமிழ்/resources/திருக்குறள்-input.csv")

