# -*- coding: utf-8 -*-

import sys
import pytamil
from pytamil import தமிழ்
from pytamil.தமிழ்  import மாத்திரை


குறள் = ['''அகர முதல எழுத்தெல்லாம் ஆதி
            பகவன் முதற்றே உலகு.''',
        '''கற்றதனால் ஆய பயனென்கொல் வாலறிவன்
            நற்றாள் தொழாஅர் எனின்.'''
        ]

def குறள்_மாத்திரைவரிசைகள்_கொடு(குறள்_அடி):
    அடிகள் = குறள்_அடி.splitlines()
    
    பதங்கள் =[]
    மாத்திரைவரிசைகள் =[]
    for அடி in  அடிகள்:
        அ = அடி.strip()
        அ = அடி.replace('.','')

        பதங்கள்.extend(அ.split())

    for பதம் in  பதங்கள்:

        மாத்திரைவரிசை = மாத்திரை.மாத்திரைவரிசை_கொடு(பதம்)
        # print(மாத்திரை.format(மாத்திரைவரிசை))
        மாத்திரைவரிசைகள்.append(மாத்திரைவரிசை)
    
    return மாத்திரைவரிசைகள்


def குறள்_மாத்திரைஎண்கள்_கொடு(மாத்திரைவரிசைகள்):
    மாத்திரைஎண்கள்=''
    for மாத்திரைவரிசை in மாத்திரைவரிசைகள்:
        for எ in மாத்திரைவரிசை:
            மாத்திரைஎண்கள் = மாத்திரைஎண்கள் +str(எ[2]) + ' '
        மாத்திரைஎண்கள் = மாத்திரைஎண்கள்.rstrip() + "    "

    return மாத்திரைஎண்கள்

# def print_மாத்திரைவரிசைகள்(மாத்திரைவரிசைகள்):




மாத்திரைவரிசைகள் = குறள்_மாத்திரைவரிசைகள்_கொடு(குறள்[0])
print(குறள்_மாத்திரைஎண்கள்_கொடு(மாத்திரைவரிசைகள்))